{"keras_version": "1.2.0", "config": [{"config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faG/home/mikkel/DeployedProjects/CarND-Behavioral-Cloning-Project/model.py\u00da\b<lambda>N\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape": null, "batch_input_shape": [null, 80, 160, 3], "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "trainable": true}, "class_name": "Lambda"}, {"config": {"nb_row": 3, "subsample": [1, 1], "nb_filter": 8, "activity_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_1", "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "subsample": [1, 1], "nb_filter": 16, "activity_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_2", "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "subsample": [1, 1], "nb_filter": 32, "activity_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_3", "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "subsample": [1, 1], "nb_filter": 64, "activity_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_4", "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "subsample": [1, 1], "nb_filter": 128, "activity_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_5", "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "input_dim": 768, "activation": "linear", "output_dim": 128, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_2", "W_regularizer": null, "input_dim": 128, "activation": "linear", "output_dim": 64, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_3", "W_regularizer": null, "input_dim": 64, "activation": "linear", "output_dim": 1, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}